src/InformationRegisters/РегистрНоминалаПени/РегистрНоминалаПени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрНоминалаПени</name>
  <resources>
    <name>НоминалПени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаВступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/ОстаткиНачисленийСтудентов/ОстаткиНачисленийСтудентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНачисленийСтудентов</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/НачислениеОплатыЗаОбучение/НачислениеОплатыЗаОбучение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеОплатыЗаОбучение</name>
  <registerRecords>AccumulationRegister.ОстаткиНачисленийСтудентов</registerRecords>
  <registerRecords>InformationRegister.РегистрОпераций</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Льгота</name>
    <type>
      <types>CatalogRef.Льготы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеНачисления</name>
    <type>
      <types>CatalogRef.ДополнительныеНачисления</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗачисленнойОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьНачислениеОплаты</name>
  </tabularSections>
</mdclass:Document>

src/Documents/НачислениеПениПоЗадолженности/НачислениеПениПоЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеПениПоЗадолженности</name>
  <registerRecords>AccumulationRegister.ОстаткиПениСтудентов</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НачисленнаяПеня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/CommonModules/НачислениеПениСервер/Module.bsl
Процедура НачислениеПениСтудентам() Экспорт
	//получить текущий номинал пени
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	ЗапросТекущийНоминалПени = Новый Запрос;
	ЗапросТекущийНоминалПени.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса); 
	ЗапросТекущийНоминалПени.Текст = "
		|SELECT TOP 1
		|	НоминалПени
		|FROM РегистрСведений.РегистрНоминалаПени
		|WHERE ДатаВступления <= &ТекущаяДата
		|ORDER BY ДатаВступления DESC
		|";
	ТекущийНоминалПени = ЗапросТекущийНоминалПени.Выполнить().Выгрузить();
	НоминалПени = ?(ТекущийНоминалПени.Количество() > 0, 
		ТекущийНоминалПени[0][0], 
		0);
	
	//получение суммы текущих начислений
	ТекущиеНачисленияСтудентов = РегистрыНакопления.ОстаткиНачисленийСтудентов.Остатки();
	
	//Получаем сумму начислений, срок оплаты которых ещё не прошёл
	ЗапросБудущихНачислений = Новый Запрос;
	ЗапросБудущихНачислений.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса); 
	ЗапросБудущихНачислений.Текст = "
		|SELECT
		|	Студент,
		|	SUM(СуммаЗачисленнойОплаты) AS СуммаБудущихНачислений
		|FROM Документ.НачислениеОплатыЗаОбучение
		|WHERE ДатаОплаты > &ТекущаяДата
		|GROUP BY Студент;
		|";
	БудущиеНачисленияСтудентов = ЗапросБудущихНачислений.Выполнить().Выгрузить();
	
	Для каждого ТекущиеНачисленияСтудента из ТекущиеНачисленияСтудентов Цикл
		КритерийСтудент = Новый Структура("Студент", ТекущиеНачисленияСтудента[0]);
		
		ТекущиеНачисления = ТекущиеНачисленияСтудента[1];
		БудушиеНачисленияСтудентаМассив = БудущиеНачисленияСтудентов.НайтиСтроки(КритерийСтудент);
		БудущиеНачисления = ?(БудушиеНачисленияСтудентаМассив.Количество() > 0, 
			БудущиеНачисленияСтудентов.НайтиСтроки(КритерийСтудент)[0][1], 
			0);
		Задолженность = ТекущиеНачисления - БудущиеНачисления;
		Если Задолженность > 0 Тогда
			ДокументНачисленияПени = Документы.НачислениеПениПоЗадолженности.СоздатьДокумент();
			ДокументНачисленияПени.Дата = ТекущаяДатаСеанса;
			ДокументНачисленияПени.Студент = ТекущиеНачисленияСтудента[0];
			ДокументНачисленияПени.НачисленнаяПеня = Задолженность * НоминалПени / 100;
			ДокументНачисленияПени.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
